#todo: Определить в коде  переменные:

#1. Целочисленного типа
#2. Вещественного типа
#3. Логического типа
#4. Строкового типа
#5. Пустого типа

#Вывести все их типы.
x=7
print("1.Целочисленного типа - int x=",x)
print(type(x))
x=4.5
print("2.Вещественного типа - float x=",x)
print(type(x))
x=True
print("3.Логического типа - bool x=",x)
print(type(x))
x="Дима"
print("4.Строкового типа - str x=",x)
print(type(x))
x=None
print("5.Пустого типа - none x=",x)
print(type(x))